app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO `comments` (`text`, `user_id`, `prototype_id`, `created_at`, `updated_at`) VALUES ('nsnfgs', 2, 2, '2021-01-12 06:51:11.888885', '2021-01-12 06:51:11.888885')