app/controllers/prototypes_controller.rb

SELECT `prototypes`.* FROM `prototypes`
---
  def index
    @prototypes = Prototype.all

INSERT INTO `prototypes` (`created_at`, `updated_at`, `title`, `catch_copy`, `concept`, `user_id`) VALUES ('2021-01-09 10:19:06.731580', '2021-01-09 10:19:06.731580', 'nsg', 'bda', 'bad', 1)
---
  def create
    @prototype = Prototype.new(prototype_params)

    if @prototype.save

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 5 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 2
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
---
  def show
    @prototype = Prototype.find(params[:id])
    @comment = Comment.new
    @comments = @prototype.comments.includes(:user)

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
---
  def edit
    @prototype = Prototype.find(params[:id])

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 5 LIMIT 1
UPDATE `prototypes` SET `prototypes`.`title` = '変えちゃった', `prototypes`.`user_id` = 1, `prototypes`.`updated_at` = '2021-01-12 11:11:50.352578' WHERE `prototypes`.`id` = 5
---
  def update
    prototype = Prototype.find(params[:id])

    if prototype.update(prototype_params)

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 1
---
  def destroy
    prototype = Prototype.find(params[:id])
    prototype.destroy

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 3 LIMIT 1
---
  def move_to_index
    prototype = Prototype.find(params[:id])